[
    {
      "id": "0199414‬",
      "name": "‫נושאים מתקדמים בתכנות מונחה עצמים",
      "value": "3.5",
      "required": 1,
      "condition": [
        "0121503"
      ],
      "data":" דרישות קדם: תכנות בשפת ++C הקורס יעסוק בנושאים מתקדמים של תכנות מונחה-עצמים, ומטרותיו העיקריות הן להביא את הסטודנטים לשליטה מלאה בפרדיגמת תכנות זו לצד התמקצעות טכנית מעמיקה בשפת ++C( תקן 14/11 .)בחלקו הראשון הקורס יעמיק בנושאים טכניים בשפת ++C ,ובחלקו השני יתמקד בתכנות מונחה-עצמים מתקדם, ובפרט בתבניות תכן )patterns design )ובתבניות תכנות נפוצות עבור מקרי- בוחן שונים.",
      "group":["software"]
      
    },
    {
      "id": "0199820‬",
      "name": "נושאים מתקדמים בפיתוח תוכנה",
      "value": "3.5",
      "required": 1,
      "condition": [
        "0121503"
      ],
      "group":["software"],
      "data":"דרישות קדם: תכנות מתקדם בשפה כלשהי )Java או ++C) מטרת הקורס להקנות לסטודנט ידע וראיה כוללת של תחום הנדסת התוכנה, המאפשרת פיתוח פרוייקטים בצוות. בקורס נדון ביצירת דרישות למערכות תכנה, ניתוחן וניהולן; מודלים של מחזור חיים של תכנה, החל בשלב התכן, ועבור לטכניקות פיתוח, אינטגרציה, בקרת איכות, הפצה, התקנה ותמיכה. נכיר כילים שנועדו לסייע בשלבים אלה: שפת המידול UML ,כלי עזר בפיתוח תכנה )case ,)כילים לניהול גרסאות תכנה וכלי עזר לבדיקות תכנה. הקורס ילווה במעבדה בה יפותח פרוייקט לדוגמא תוך שימוש בשיטות ובכילים הנלמדים במקביל. "
    },
    {
      "id": "0199527‬",
      "name": "מסדי נתונים",
      "value": "3.5",
      "required": 0,
      "condition": [
        "0121407"
      ],
      "group":["software","web"],
      "data":"דרישות קדם: פרקים במבני נתונים הקורס מציג מושגים יסודיים של מערכות מסדי נתונים ושל עיצוב מסדי נתונים: מודל ישויות – קשרים )R-E ,)מודל היחסים )model relational ,)סכמות של מסד, אלגברת יחסים, תחשיב יחסים,כללי נרמול באמצעות תלויות פונקציונאליות ובאמצעות תלויות רב-ערכיות. שפת השאילתות SQL נלמדת בהרחבה: הגדרה של עצמים במסד (DDL ,(שאילתות אחזור ועדכון (DML ,(תצפיות (views ,(אילוצים, והדקים (triggers .(בנוסף הקורס עוסק בהיבטים המערכתיים של מערכות לניהול מסדי נתונים: ניהול תנועות, התאוששות ובקרת בו-זמניות. נושאים אלו נלמדים בהקשר של שילוב SQL בשפה מארחת. התרגול נעשה במערכת Access Microsoft ובסביבת MySQL."
    },
    {
      "id": "0199831",
      "name": "תכנות בסביבת האינטרנט‪",
      "value": "3.5",
      "required": 0,
      "condition": [
        "0121502"
      ],
      "group":["software","web"],
      "data":"דרישות קדם: תכנות מונחה עצמים ג'אווה הקורס תכנות בסביבת האינטרנט נועד להקנות ידע תכנותי בתחום הרשת, הכולל תכנות אתרים ושרתים, בשפות הנפוצות כיום בשוק. הקורס יכלול סקירה מעמיקה של אבני הבניין של הרשת )JAVASCRIPT, CSS, HTML ,)ימשיך בנושאים מתקדמים )bootstrap, JQuery )וכלי עזר לתכנות ברשת, ועד יצירת שרתים בשפות PHP ו-#C."
    },
    {
      "id": "0199818‬",
      "name": "סדנת תוכנה במערכות סלולריות‪",
      "value": "2.0",
      "required": 0,
      "condition": [
        "0121502"
      ],
      "group":["software","web","network"],
      "data":"הקורס נוסב סביב פיתוח אפליקציות היברידיות לטלפונים סלולריים תוך התמקדות במערכת ההפעלה אנדרואיד. במהלך הקורס נכיר מגוון רחב של טכנולוגיות צד-לקוח מעולם תכנות הרשת  )לרבות 5 HTML ,)ונלמד כיצד להשתמש בהן בפיתוח אתרים, אפליקציות היברידיות לטלפונים סלולריים, ואפליקציות היברידיות לפלטפורמות אחרות. הקורס יעסוק בתכנות Native בשפת JAVA ,ויכלול נושאי בסיס )ארכיטקטורת אנדרואיד ואפליקציות פשוטות( וכן נושאים מתקדמים )תכנות למכשירים בגדלים שונים, עבודה עם שרתים ושירותים חיצוניים, ועוד(."
    },
    {
      "id": "0199539‬",
      "name": "סדנת תוכנה ב ‪ #C‬ו net.‪",
      "value": "2.0",
      "required": 0,
      "condition": [
        "0121502"
      ],
      "group":["software","web"],
      "data":"דרישות קדם: תכנות מונחה עצמים )Java) מבוא ל .Framework NET .הכרות עם סביבת העבודה, בניית אפליקציה פשוטה, שימוש ב debugger ;סינטקס של #C ,מבני בקרה, מתודות, מערכים; OOP ב #C :מחלקות, הורשה, פולימורפיזם, Interfaces ,העמסת אופרטורים; טיפול בשגיאות זמן ריצה )handling Exception ;) מחרוזות וביטויים רגולריים; תכנות גנרי ואוספים )collections ;)דלגטים )delegates )ואירועים )events ;)עבודה עם מסדי נתונים: model disconnected ,מבוא ל SQL ,מבוא ל LINQ ;בניית אפליקצית חלונות עם Forms Widows :Controls User ;בנית תוכנית מרובת נימים; עבודה עם streams ,קלט ופלט; בניית שרות WCF"
    },
    {
      "id": "0131301‬",
      "name": "ארכיטקטורת מחשבים",
      "value": "3.5",
      "required": 0,
      "condition": [
        "0111304"
      ],
      "group":["software","network"],
      "data":"דרישות קדם: מערכות ספרתיות ותכן לוגי מדדים לביצועי המחשב, חוק אמדאל, חזרה על מעגלים צירופיים סטנדרטיים, מכונות המצבים של Mealy ו-Moore ,צמצום מצבים, שפת אסמבלי של MIPS ,הקשר בין מבנה המחשב ואוסף ההוראות, RISC לעומת CISC ,מעבר מן התוכנה לחומרה, ביצוע ההוראות ב-CPU ,ארכיטקטורות Cycle Single ,Cycle Multi ו- Pipeline ,יחידת הבקרה. שיפור בביצועי הזיכרון ע\"י הוספת זיכרון מטמון )Cache ,)מנגנון הזיכרון הוירטואלי וניהול הזיכרון, ריבוי משימות, התקני קלט/פלט."
    },
    {
      "id": "0199830",
      "name": "‫אלגוריתמים ‪2‬‬",
      "value": "3.5",
      "required": 0,
      "condition": [
        "0122407"
      ],
      "group":["software"],
      "data":"דרישות קדם: ציון 75 ומעלה באלגוריתמים 1.  סדנה על אלגוריתמים רלוונטים להיום הסדנה כוללת הצגת אלגוריתם בזוג  נוכחות חובה"
    },
    {
      "id": "0122423",
      "name": "עקרונות שפות תכנות",
      "value": "3.5",
      "required": 1,
      "condition": [
        "0121109",
        "0121407"
      ],
      "group":["software","web","network"],
      "data":"דרישות קדם: פרקים במבני נתונים, לוגיקה למדעי המחשב הקורס מציג בפני התלמיד )שלמד תכנות פרוצדורלי ותכנות מונחה-עצמים( שתי פרדיגמות תכנות נוספות: תכנות פונקציונאלי ותכנות לוגי )programming logic .)הפרדיגמות נלמדות ומתורגלות באמצעות שפות התכנות פרולוג ו- Scheme .החלק הראשון של הקורס עוסק בעקרונות התכנות הפונקציונאלי ודן במאפיינים של פרדיגמה זו ובפרט ביתרונות של הימנעות מהשפעת לוואי ) side effects )ומפעולות הרסניות. בנוסף אנו דנים בנושאים הבאים: תחום הצהרה )scope )דינאמי ולקסיקלי, תחביר וייצוגו, אינטרפרטציה של תכניות ועוד. החלק השני של הקורס מציג את הקשר בין הלוגיקה לתכנות הלוגי ומתאר את המנגנונים של האחדה ונסיגה ככלים לתכנות הצהרתי."
    },
    {
      "id": "0132402",
      "name": "מבנה קומפיילרים",
      "value": "3.5",
      "required": 1,
      "condition": [
        "0131408",
        "0121407"
      ],
      "group":["software","web","network"],
      "data":"דרישות קדם: אוטומטים ושפות פורמליות, פרקים במבני נתונים ניתוח לקסיקלי. ניתוח תחבירי. תרגום מונחה תחביר. בדיקת טיפוסים. סביבת זמן ריצה. יצירת קוד ביניים, יצירת קוד, אופטימיזציה של קוד."
    },
    {
      "id": "0199419‬",
      "name": "מבוא לעיבוד אותות‬‬",
      "value": "3.5",
      "required": 1,
      "condition": [
        "0111101",
        "0111102"
      ],
      "group":["AI","signal"],
      "data":"דרישות קדם: חדו\"א 1 ,אלגברה 1 בקורס זה יודגשו ההיבטים השימושיים של תורת האותות והמערכות, לצד לימוד העקרונות המתמטיים. דגש מיוחד יינתן לעיבוד ספרתי של אותות. נושאי הקורס: מבוא: ייצוג מתימטי של אותות ומערכות, שימושים של עיבוד ספרתי של אותות, אותות ומערכות בסיסיים. אותות סינוסואידליים. ייצוג של אותות סינוסואידליים באמצעות אקספוננציאלים קומפלכסיים, מעבדה: יצירת אותות בסיסיים בעזרת Matlab ,הצגה ספקטרלית: אותות מחזוריים ולא מחזוריים, שימושים: אותות דיבור ואותות מוזיקליים, מודולציית אמפליטודה ותדר )AM ו- FM ,)מעבדה: סינתזה של אותות מוסיקליים, מבוא לדגימה: כיצד דוגמים אות - משפט הדגימה, מבט ספקטרלי על  דגימה, שימושים: מערכות דגימה ושחזור, מבוא לכימוי )קוונטיזציה(. מסננים ספרתיים: FIR ו- IIR .סינון אות מרעש, מיצוע והחלקת אותות, מעבדה: אותות סינוסואידליים, חיוג צלילים טלפוני, שימושים בתקשורת, מודולציה ודמודולציה, גילוי מעטפת, AM של אותות דיבור. מבוא לאותות אקראיים. תרגיל מעבדה: גילוי אותות ראדאר, מעבדה: סינון וגילוי קצוות של תמונות, התמרת פורייה והתמרת Z ,מעבדה: אותות ביולוגיים, אנליזה ספקטרלית: אנליזה ספקטרלית של אותות מחזוריים ולא מחזוריים, הספקטרוגרם, שימושים: ספקטרוגרם של אותות דיבור ומוסיקה, דיבור מסונן. התמרת פורייה מהירה )FFT .)מעבדה: מיצוי תדירויות של צלילים מוסיקליים."
    },
    {
      "id": "0199617‬",
      "name": "עיבוד אותות קול ותמונה‬",
      "value": "3.5",
      "required": 1,
      "condition": [
        "0199419‬"
      ],
      "group":["signal"],
      "data":"דרישות קדם: מבוא לעיבוד אותות אפיון תמונה וקול, אפיון מערכות ראייה, מודל יצירת הדיבור, ספרור התמונה ואות הקול, פעולות לשיפור הניגודיות בתמונה, פעולות סינון מרחביות של התמונה, פעולות סינון זמניות של אות הקול, הפחתת רעש בתמונה ובאות הדיבור, פעולות סינון בתחום התדר, תמונה ודיבור – אלגוריתמים לדחיסה ותקני דחיסה, ראייה ממוחשבת וזיהוי עצמים בתמונה, זיהוי דיבור."
    },
    {
      "id": "0199803‬",
      "name": "עיבוד ספרתי של אותות בזמן אמת",
      "value": "3.5",
      "required": 0,
      "condition": [
        "0199419‬"
      ],
      "group":["network","signal"],
      "data":"אין פרטים יעודכנו במשך"
    },
    
    {
      "id": "0199611‬",
      "name": "‫סדנה בדחיסת אותות‪ ,‬תמונות ווידאו‪",
      "value": "2.0",
      "required": 0,
      "condition": [
        "0122108"
      ],
      "group":["signal"],
      "data":"דרישות קדם: מתמטיקה שימושית ותכנות מדעי )מבוא לעיבוד אותות – יתרון(. דחיסת תמונות: רקע, עקרונות, מערכות, סטנדרטים (4-G3, JBIG, JPEG .(דחיסת וידאו: עקרונות, מערכות וסטנדרטים )2-MPEG1, 261.H . )דחיסת דיבור: מערכת הדיבור, מודלים, עקרונות דחיסה וסטנדרטים. דחיסת אודיו: עקרונות, מודלים פסיכו-אקוסטיים, סטנדרטים. גישות מודרניות .MPEG-4, Wavelets :מידע לדחיסה"
    },
    {
      "id": "0199811",
      "name": "בינה חישובית",
      "value": "3.5",
      "required": 0,
      "condition": [
        "0122103",
        "0112104",
        "0122106",
        "0122407"
      ],
      "group":["AI","signal"],
      "data":"דרישות קדם: חדו\"א 2(מ(, אלגברה מודרנית, מבוא להסתברות, אלגוריתמים 1 הקורס יעסוק בבינה חישובית, שמקור השראתה הינו מודלים ביולוגיים בעלי \"התנהגות חכמה\", לצורך בניית אלגוריתמים לפיתרון בעיות מורכבות בתחומי הלמידה והאופטימיזציה. נושאי הקורס יכללו שיטות חישוביות רכות, מבוא לבעיות מורכבות בלמידה ואופטימיזציה, אופטימיזציה מסורתית לעומת יוריסטיקות מבוססות סימולציה, רשתות נוירונים: ממודל הנוירון ועל לרשתות מורכבות, חישוביות אבולוציונית )Computation Evolutionary )ואלגוריתמים גנטיים,  בינה קבוצתית )Intelligence Swarm :)מושבות נמלים ולהקות ציפורים, מערכות חיסון ) Artificial Systems Immune )לפיתרון בעיות, לוגיקה עמומה )Logic Fuzzy )ומערכות עמומות בבעיות מורכבות."
    },
    {
      "id": "0199628",
      "name": "ביג דאטה",
      "value": "3.5",
      "required": 0,
      "condition": [
        "0122106",
        "0121502"
      ],
      "group":["signal","AI","web"],
      "data":"דרישות קדם: תכנות מונחה עצמים )Java, )מבוא להסתברות השגת מידע: השגת מידע מבסיסי נתונים ציבוריים ופרטיים, פורמטים מקובלים של קבצי נתונים, הכנת המידע לניתוח. חיפוש במאגרי מידע: בדיקה ראשונית של שאלת המחקר, הפקה והצגה של הנתונים, התאמת מודלים וכלים לניתוח מתקדם. הסקה סטטיסטית: מציאת קורלציה בין נתונים )Pearson, Spearman ,)הערכת מובהקות סטטיסטית, פיתוח מודלים סטטיסטים, התמודדות עם ערכים חסרים. הכללת מסקנות: שימוש במודלים לרגרסיה לינארית וב-learning machine להסקת מסקנות וניבוי התנהגות עתידית ניתוח מאגרי מידע בעזרת שפת R :עקרונות השפה, חבילות תוכנה )packages )לניתוחים סטטיסטים, כריית מידע ומטלות אחרות של ניתוח מידע, סביבת העבודה RStudio. טכנולוגיות לניתוח data Big :כולל MapReduce, Hadoop ומחשוב ענן."
    },
    {
      "id": "0199615",
      "name": "ראייה ממוחשבת",
      "value": "3.5",
      "required": 0,
      "condition": [
        "0111102",
        "0112104"
      ],
      "group":["AI","signal"],
      "data":"דרישות קדם: אלגברה לינארית )מ(, חדו\"א 2(מ( קורס זה עוסק במבוא לעיבוד תמונות וראייה ממוחשבת, מבנה תמונות, סינון תמונות, גילוי שפות, גילוי נקודות עניין, סגמנטציה ,סיווג, וזיהוי. נושאי הקורס: מבוא וסקירה כללית שימושים ומימושים, מצלמות ויצירת תמונות דיגיטליות, מסננים לינארים על תמונות, זיהוי שפות ופינות, טקסטורה, סטריאו, סגמנטציה, התאמת מודל למידע, פעולות מורפולוגיות על תמונה, סיווג, מבנים פירמידליים, מרחבי צבע, זהוי מתוך נקודות אפיון איווריאנטיות , התאמת תמונות, יצירת פנורמה, זיהוי פרצופים - אלגוריתם ויולה ג׳ונס."
    },
    {
      "id": "0199626",
      "name": "למידה חישובית וזיהוי תבניות",
      "value": "3.5",
      "required": 1,
      "condition": [
        "0122106",
        "0122108"
      ],
      "group":["AI","signal"],
      "data":"דרישות קדם: מתימטיקה שימושית ותכנות מדעי , מבוא להסתברות. מבוא ללמידה חישובית: מהי למידה, דוגמאות ללמידה חישובית, למידה מודרכת ולא מודרכת. רגרסיה ליניארית: בעיית הרגרסיה, היפותזת למידה, אלגוריתם ה- LMS ,descent gradient ,פתרון מטריצי, המשוואות הנורמליות. רגרסיה לוגיסטית: בעיית סווג בינארית, משטח החלטה ליניארי ולא ליניארי, התאמת פרמטרים, פונקציית מחיר, עיקרון הסבירות המירבית, סווג רב מחלקתי, רגולריזציה, דוגמאות: זיהוי spam .מסווגים ליניאריים: פרספרטרון, אלגוריתם לימוד הפרספטרון, שוליים וגאומטריה, הפרספטרון כרכיב לוגי, נתונים לא פרידים ליניארית, אלגוריתם הכיס, בעיית סווג ספרות בכתב יד. מבוא ל- Machines Vector Support :שוליים רחבים, שוליים גאומטריים מקסימליים, פרמטרי offset ,אימות צולב, varibales slack .למידה ביאסיאנית: תורת ההחלטות הביאסיאניות, כלל Bayes ,עיקרון הסתברות אפוסטריורית מקסימלית (MAP ,(תכונות רציפות, יחס הנראות, סווג קצב שגיאה מינימלי, סווג סיכון מינימלי, סווג ביאסיאני נאיבי. רגולריזציה ובחירת מודל. מבוא לרשתות עצביות: היפותזות לא ליניאריות, הפרספרטרון, רשת עצבית מלאכותית, רשת Forward-Feed ,אלגוריתם הלימוד להתאמת הפרמטרים, לימוד באמצעות Propagation Back , דוגמאות: סווג ספרות ואותיות בכתב יד. הפחתת ממדים, מבוא למודלים מרקוביים חבויים."
    },
    {
      "id": "0199624",
      "name": "מבוא לבינה מלאכותית",
      "value": "3.5",
      "required": 1,
      "condition": [
        "0121407",
        "0122407",
        "0121109"
      ],
      "group":["AI"],
      "data":"דרישות קדם: פרקים במבני נתונים, אלגוריתמים 1 , לוגיקה למדעי המחשב פתרון בעיות באמצעות חיפוש, חיפושים עיוורים וחיפושים מבוססי ידע, שימוש ביוריסטיקות. חיפוש בגרף מרחב מצבים וחיפוש מקומי. בעיות של עמידה באילוצים. סוגים שונים של משחקים ואסטרטגיות לניצחון במשחקים, אלגוריתם ה-MiniMax ואלגוריתם אלפא-ביתא. ייצוג ידע וביצוע היסקים באמצעות לוגיקה קלאסית. רזולוציה וסקולמיזציה. ייצוג ידע באמצעות שיטות נוספות. תכנון – סקירה ואלגוריתמים בסיסיים. למידה – סקירה ושיטות עיקריות."
    },
    {
      "id": "0199415",
      "name": "מערכות זמן אמת",
      "value": "3.5",
      "required": 1,
      "condition": [
        "0121503",
        "0132410"
      ],
      "group":["network"],
      "data":"דרישות קדם: תכנות בשפת ++C ,מערכות הפעלה מבוא. מערכות זמן אמת – הגדרה ודוגמאות. מערכות RT Hard כנגד מערכות RT Soft .מודל reference של מערכות זמן אמת. גישה כללית לתזמון במערכות RT Hard .תזמון: תזמון שעון, תזמון עפ\"י עדיפויות, תזמון לא מחזורי וספורדי, תזמון במערכת רב-מעבדים. תקשורת RT .מבוא לתורת התורים."
    },
    {
      "id": "0199815",
      "name": "רשתות מהירות",
      "value": "3.5",
      "required": 1,
      "condition": [
        "0132408",
        "0122106"
      ],
      "group":["web","network"],
      "data":"דרישות קדם: רשתות תקשורת מחשבים, מבוא להסתברות הביקוש ההולך וגדל לרוחב פס ברשת יוצר אתגרים חדשים בתכנון ומימוש רכיבי הרשת. אחד הרכיבים המרכזיים ברשת הינו מתג\\נתב התקשורת. הנתב הינו רכיב אלקטרוני עם מספר כניסות ומספר יציאות, והוא ממוקם בצמתי הרשת. תפקידו העיקרי הינו למתג חבילות שמגיעות אליו, כל חבילה ליציאה הנדרשת. הגישות הנהוגות כיום למימוש משימתו העיקרית של הנתב תחת האילוצים ההולכים וגדלים של סביבת הרשת הינן רבות ומגוונות. חלק לא מבוטל מגישות אלו נשען על בחירת ארכיטקטורת הנתב, וכן שימוש במבני נתונים ואלגוריתמים תוך כדי התאמתם לאילוצים הספציפיים של סביבת הרשת. בקורס זה נסקור גישות אלו, נקנה ידע רחב על סביבת הרשת, וכן נראה דוגמאות לשימוש מעשי במבני נתונים, אלגוריתמים, ושיטות מתמטיות שונות."
    },
    {
      "id": "0199816",
      "name": "סמינר ברשתות",
      "value": "3.5",
      "required": 0,
      "condition": [
        "0132408",
        "0122106"
      ],
      "group":["network"],
      "data":"דרישות קדם: רשתות תקשורת מחשבים, מבוא להסתברות הביקוש ההולך וגדל לרוחב פס ברשת יוצר אתגרים חדשים בתכנון ומימוש רכיבי הרשת. אחד הרכיבים המרכזיים ברשת הינו מתג\\נתב התקשורת. הנתב הינו רכיב אלקטרוני עם מספר כניסות ומספר יציאות, והוא ממוקם בצמתי הרשת. תפקידו העיקרי הינו למתג חבילות שמגיעות אליו, כל חבילה ליציאה הנדרשת. בנוסף, הנתב נדרש למשימות רבות נוספות כגון חסימת חבילות המגיעות ממקור מסוים )לצרכי אבטחה(, בחינת החבילות ומציאת וירוסים, סיווג חבילות, ביצוע מדידות שונות ועוד."
    },
    
    {
      "id": "0199817",
      "name": "סדנא מתקדמת בתוכנה לינוקס",
      "value": "2.0",
      "required": 0,
      "condition": [
        "0132410",
        "0132408"
      ],
      "group":["network"],
      "data":"אין פרטים יעודכנו במשך"
    },
    {
      "id": "0199806",
      "name": "סדנה מתקדמת במערכות הפעלה",
      "value": "2.0",
      "required": 0,
      "condition": [
        "0132410",
        "0132408"
      ],
      "group":["network"],
      "data":"אין פרטים יעודכנו במשך"
    },
    {
      "id": "0199828‬",
      "name": "סדנת מבוא להגנת הסייבר",
      "value": "2.0",
      "required": 0,
      "condition": [
        "0121502"
      ],
      "group":["web"],
      "data":"אין פרטים יעודכנו במשך"
    },
    {
      "id": "0199619",
      "name": "מבוא לקריפטולוגיה",
      "value": "3.5",
      "required": 0,
      "condition": [
        "0122407",
        "0122103"
      ],
      "group":["web"],
      "data":"דרישות קדם: אלגוריתמים 1 , אלגברה מודרנית הגדרה מתמטית של מערכת צפינה, הצפנה קלאסית: צופן קיסר, צופן הצבה, צופנים מונואלפבתים ופוליאלפבתיים, צופן ויז'נר ושיטת קסיסקי, תיאורית SHANNON :אנטרופיה ומרחק היחידות, הצפנה מודרנית סימטרית: סכמת Feistel ,DES ,3DES ו- AES ,רקע מתורת המספרים, צופן פומבי: RSA ,יישומים של תורת המספרים: אלגוריתמים למציאת מספרים ראשוניים, מבחני ראשוניות, אלגוריתמים לפרוק, צופנים פומביים אחרים: רבין*, אלגמל*, צופני KNAPSACK , עקומים אליפטיים*, אימות, חתימות דיגיטליות, סכמות החתימה של RSA ,אלגמל, DSS ,פונקציות HASH ,1 -SHA ,הפצת מפתחות, שיתוף סוד, קריפטוגרפיה קוואנטית, פריצת צופן RSA באמצעות מחשב קוואנטי* )*נושאי רשות שיילמדו במידה והזמן יספיק("
    },
    {
      "id": "0111101",
      "name": "חדווא 1",
      "value": "5.0",
      "required": 1,
      "condition": [],
      "group":["required"],
      "data":"פונקציה ממשית של משתנה יחיד: גבולות ורציפות, רציפות על קטע סגור, פונקציות מונוטוניות ופונקציות הפיכות, נגזרות, המשפטים היסודיים של החשבון הדיפרנציאלי, משפט טיילור, כלל לופיטל, חקירת פונקציה. פונקציה קדומה ושיטות אינטגרציה, אינטגרל מסויים ותכונותיו, פונקציות אינטגרביליות, המשפטים היסודיים של החשבון האינטגרלי, אינטגרל מוכלל. סדרות אינסופיות של מספרים ממשיים, טורים מספריים: מבחני התכנסות ומשפט ליבניץ."
    },
    {
      "id": "0111102",
      "name": "אלגברה ליניארית למדעי המחשב",
      "value": "5.0",
      "required": 1,
      "condition": [],
      "group":["required"],
      "data":"שדה המספרים המרוכבים, מטריצות, פעולות בין מטריצות, סוגי מטריצות. מערכות של משוואות ליניאריות – מבוא, מרחבים וקטוריים, תתי-מרחבים, מערכת משוואות הומוגניות, צירופים ליניאריים, תת-המרחב הנפרש, חיתוך של תתי-מרחבים, סכום ישר של תתי-מרחבים, מרחב השורות של מטריצה, פתרונות של מערכות משוואות ליניאריות: פעולות אלמנטריות על שורות של מטריצה, מטריצות אלמנטריות, מטריצות הפיכות, פתרון משוואות באמצעות מטריצה הפיכה, תלות ואי-תלות, בסיס ומימד,  טרנספורמציות ליניאריות, גרעין, תמונה, תכונות, דרגה ונילפוטנטיות, אופרטורים ליניאריים, פעולות בין אופרטורים ליניאריים, איזומורפיזם, ייצוג על-ידי מטריצות, שינוי בסיסים, דימיון בין מטריצות,דטרמיננטות, הגדרה, תכונות, דטרמיננטות ומטריצות הפיכות, שיטת קרמר, הצגת מטריצה או טרנספורמציה ליניארית באמצעות פולינום, ערכים עצמיים ווקטורים עצמיים, פולינום אופייני, ריבוי אלגברי וריבוי גיאומטרי."
    },
    {
      "id": "0111304",
      "name": "מערכות ספרתיות ותכן לוגי",
      "value": "4.0",
      "required": 1,
      "condition": [],
      "group":["required"],
      "data":"הקורס מקנה ידע בסיסי במערכות ספרתיות ובתכן לוגי. במסגרת הקורס יילמדו פונקציות בוליאניות, אלגברה בוליאנית, מימוש מערכות ספרתיות ושיטות שונות לתכן לוגי של מערכות ספרתיות : מעגלים צירופיים )מרבבים, מפלגים, מפענחים, משווים, מסכמים, יחידות אריתמטיות לוגיות(, מעגלים סדרתיים )יחידות בקרה, אוגרים, זיכרונות(, מיקרו-מעבדים. שימוש בכלי CAD תעשייתיים לבדיקת תחביר (Compilation ,(לכתיבת עירור (Stimuli (ולהדמיית התכנון (Simulation."
    },
    {
      "id": "0111401",
      "name": "מבוא למדעי המחשב",
      "value": "5.0",
      "required": 1,
      "condition": [],
      "group":["required"],
      "data":"הקורס מלמד את עקרונות התכנות הבסיסיים באמצעות שפת פייתון. מבנה המחשב, שפות תכנות עיליות, מושגי יסוד בשפת פיתון: אופרטורים, טיפוסי נתונים, ביטויי תנאי, איטרציות, פונקציות, רשימות ורשימות מקוננות. comprehension list ,מודל הזיכרון של פייתון ותופעות לוואי של פונקציות. גישה אלגוריתמית לפתרון בעיות: מציאת מספרים ראשוניים וחישוב חזקה בצורה יעילה. חישובי סיבוכיות. dictionary, tuples ,פעולות ברשימות: חיפוש בינארי ומיון. פתרון בעיות באמצעות רקורסיה, פונקציות רקורסיביות. פונקציות מסדר גבוה. מבוא לתכנות מונחה-עצמים: אובייקטים, מחלקות, תכונות )attributes )ושיטות )methods.)"
    },
    {
      "id": "0112104",
      "name": "חדווא 2",
      "value": "5.0",
      "required": 1,
      "condition": [
        "0111101"
      ],
      "group":["required"],
      "data":"דרישות קדם: חדו\"א 1(מ( סדרות וטורי פונקציות, טורי חזקות. וקטורים במרחב תלת ממדי. מכפלות: סקלרית, ווקטורית, מעורבת. מישור במרחב, ישר במרחב. פונקציות של מספר משתנים, גבולות ורציפות. נגזרות חלקיות מסדרים גבוהים, נוסחת טיילור. פונקציות סתומות, מערכות פונקציות סתומות. אקסטרמום של פונקציות של מספר משתנים, אקסטרמום מותנה, כופלי לגרנג'. אינטגרל כפול ומשולש, החלפת משתנים באינטגרל כפול ומשולש. פונקציה ווקטורית של משתנים סקלרים. אינטגרל קווי ומשטחי. משפטי גרין, גאוס וסטוקס."
    },
    {
      "id": "0121108",
      "name": "מתמטיקה דיסקרטית",
      "value": "4.0",
      "required": 1,
      "condition": [],
      "group":["required"],
      "data":"תורת הקבוצות: מושגי יסוד, פונקציות, חד-חד-ערכיות, על והפיכות, עוצמות של קבוצות, משפט קנטור, משפט קנטור-שרדר-ברנשטיין, יחסים, יחסי סדר, יחסי שקילות, אינדוקציה, משפט החתונה של הול. קומבינטוריקה: עקרון הכפל ועקרון החיבור, בחירות עם ובלי חזרות, עם ובלי סדר, נוסחת הבינום, הכלה והדחה, רקורסיה, מספרי קטלן, זהויות קומבינטוריות."
    },
    {
      "id": "0121405",
      "name": "מבוא לתכנות מערכות",
      "value": "3.5",
      "required": 1,
      "condition": [
        "0111401"
      ],
      "group":["required"],
      "data":"דרישות קדם: מבוא למדעי המחשב הקורס מהווה המשך ישיר לקורס מבוא למדעי המחשב. מטרתו העיקרית הנה בסוס יכולת התכנות של הסטודנט, ע\"י כתיבת תוכניות גדולות ומורכבות. כמו כן הקורס מקנה ידע מקיף ונרחב בשפת C והיכרות עם מערכת ההפעלה לינוקס. בין הנושאים הנלמדים בקורס: מצביעים והקצאות דינמיות, מבוא למבני נתונים )רשימות מקושרות עצים בינאריים וגרפים(, עבודה עם קבצים וביטים. "
    },
    {
      "id": "0121502",
      "name": "תכנות מונחה עצמים ג'אווה",
      "value": "3.5",
      "required": 1,
      "condition": [
        "0111401"
      ],
      "group":["required"],
      "data":"דרישות קדם: מבוא למדעי המחשב זהו קורס מבוא לתכנות מונחה-עצמים באמצעות שפת התכנות ג'אווה. מוצגים הנושאים הבסיסיים הבאים: מחלקות ועצמים, כימוס (encapsulation (והסתרת מידע (hiding information ,(הורשה, העמסה (overloading (והגדרה מחדש (overriding (של שיטות, ממשקים ומחלקות מופשטות, פולימורפיזם, מחלקות מקוננות, מרחבי שמות )באמצעות חבילות – packages .)בנוסף, הקורס מכסה יישומים (applications (ויישומונים (applets (גרפיים, יצירת ממשקי משתמש גרפיים (GUI ,(טיפול באירועי משתמש (events user ,(וטיפול בחריגות (exceptions.("
    },
    {
      "id": "0122103",
      "name": "אלגברה מודרנית",
      "value": "3.0",
      "required": 1,
      "condition": [
        "0121108",
        "0111102"
      ],
      "group":["required"],
      "data":"דרישות קדם: אלגברה לינארית)מ(, מתמטיקה דיסקרטית תורת המספרים: חלוקה עם שארית, מחלק משותף מקסימלי, האלגוריתם של אוקלידס, זרות, ראשוניות, המשפט היסודי של האריתמטיקה, מספר וסכום מחלקים, מספרים מושלמים, משפט השאריות הסיני, פונקצית אוילר, משפט פרמה - אוילר, שימושים להצפנה )RSA.) מבנים אלגבריים – חבורות: דוגמאות )חבורת השאריות ממספר שלם ביחס לחיבור, חבורת השאריות הזרות למספר שלם ביחס לכפל, חבורת התמורות, חבורות מטריצות, חבורה ציקלית(, תכונות יסודיות, חבורות חלקיות, קוסטים, יחס ההצמדה, חבורת מנה, הומומורפיזמים, חבורות חלקיות נורמליות, חבורות מנה, משפטי האיזומורפיזם."
    },
    {
      "id": "0112402",
      "name": "ארגון ותכנות המחשב",
      "value": "3.0",
      "required": 1,
      "condition": [],
      "group":["required"],
      "data":"ארגון החומרה: יע\"מ, זיכרון מרכזי, התקני קלט/פלט והתקני אחסון משניים. תכנות בשפת סף ובשפת מכונה, הכנת תכנית לביצוע, הכרת תכניות מערכת: אסמבלר, תכניות קישור וטעינה, פסיקות תוכנה ופסיקות חמרה, ביצוע קלט/פלט ברמות הפשטה שונות, תכניות שירות של מערכת הפעלה ושל BIOS ,תכניות תושבות בזיכרון."
    },
    {
      "id": "0121109",
      "name": "לוגיקה למדעי המחשב",
      "value": "3.0",
      "required": 1,
      "condition": [
        "0121108"
      ],
      "group":["required"],
      "data":"דרישות קדם: מתמטיקה דיסקרטית תחשיב הפסוקים: הסקה טבעית, כללי הסקה, סמנטיקה לתחשיב הפסוקים, נאותות ושלמות של תחשיב הפסוקים; צורות נורמליות; מודלים, גרירה לוגית; תחשיב הפרדיקטים )תחשיב היחסים(: מבנה השפה, הוכחות בתחשיב הפרדיקטים, סמנטיקה בתחשיב הפרדיקטים, מודלים, גרירה לוגית."
    },
    {
      "id": "0121407",
      "name": "פרקים במבני נתונים",
      "value": "5.0",
      "required": 1,
      "condition": [
        "0121108",
        "0111101",
        "0121502",
        "0121405"
      ],
      "group":["required"],
      "data":"דרישות קדם: מתמטיקה דיסקרטית, חדו\"א 1(מ(, תכנות מונחה עצמים )Java ,) במקביל חדו\"א 2(מ( יסודות מתמטיים: חסמים על גידול של פונקציות, מיון בועות ומיון הכנסה. מיון מיזוג ונוסחאות נסיגה, מבני נתונים בסיסיים: מחסניות ותורים, רשימות מקושרות. עצי חיפוש בינרים. עצים אדומים שחורים. עצי AVL .טבלאות גיבוב, ערמות ומיון ערימה, רשימת דילוגים, מיון מהיר, חסמים תחתונים על מיון, מיון בזמן ליניארי, חציונים וערכי מיקום. עצי +B ,Tries ,מבנה נתונים לקבוצות זרות )FIND-UNION ,)שיטות ניתוח לשיעורין: הצבירה, החיובים והפוטנציאל. מבני נתונים לגרפים. המעבדה עוסקת במימוש של מבני נתונים קלאסיים: רשימות מקושרות, מחסניות, תורים, טבלאות גיבוב )tables-hash )ועצים. האלגוריתמים הקשורים לשימוש במבני נתונים אלו נלמדים בחלק העיוני של הקורס. המעבדה מתמקדת בהגדרת מבני הנתונים ובמימוש האלגוריתמים בשפת ג'אווה, תוך שימוש בחומר שנלמד בהרצאות. המעבדה מציגה עקרונות של תכנות מבני ומודולרי תוך שימוש בכלים של תכנות מונחה-עצמים כמו: כימוס, הורשה ופולימורפיזם."
    },
    {
      "id": "0121503",
      "name": "C++ בשפת תכנות",
      "value": "3.5",
      "required": 1,
      "condition": [
        "0121502",
        "0121405"
      ],
      "group":["required"],
      "data":"דרישות קדם: תכנות מונחה עצמים )Java ,) מבוא לתכנות מערכות שפת ++C כ-C משופרת, newו-delete ,מחלקות ב ++C ,הפרדת ממשק ממימוש, בנאים ומפרקים, friend,העמסת אופרטורים, הורשה והורשה מרובה, פונקציות וירטואליות ופולימורפיזמים, המרות, templates ומבוא ל-STL ,חריגות (exceptions ,(קלטים/פלטים ומשפחת streams ,ניהול קבצים, פוינטר חכם."
    },
    {
      "id": "0122106",
      "name": "מבוא להסתברות",
      "value": "4.0",
      "required": 1,
      "condition": [
        "0112104",
        "0121108"
      ],
      "group":["required"],
      "data":"דרישות קדם: חדו\"א 2(מ( , מתמטיקה דיסקרטית חישובי הסתברות המבוססים על מנייה, אקסיומות ההסתברות, מאורעות, הסתברות מותנית, תלות בין מאורעות, נוסחת Bayes . משתנים מקריים בדידים: פונקציות הסתברות, תוחלת של משתנה מקרי, שונות. הכרת משתנים מקריים בדידים מיוחדים )ברנולי, בינומי, פואסון, גיאומטרי, בינומי שלילי, היפרגיאומטרי(.  משתנים מקריים רציפים: פונקצית צפיפות, פונקצית התפלגות מצטברת, תוחלת ושונות. משתנה מקרי אחיד, משתנה מקרי נורמלי, משתנה מקרי מעריכי. התפלגויות רציפות אחרות: גאמה, קושי, ביתה. התפלגות משותפת, תלות בין משתנים מקריים, תכונות התוחלת, מומנטים, פונקציה יוצרת מומנטים, תוחלת מותנית, סכום משתנים מקריים, שונות משותפת, מתאם. משפטי גבול: אי-שוויון צ'בישב, החוק החלש של המספרים הגדולים, משפט הגבול המרכזי."
    },
    {
      "id": "0122108",
      "name": "מתמטיקה שימושית",
      "value": "5.0",
      "required": 1,
      "condition": [
        "0111101",
        "0111102"
      ],
      "group":["required"],
      "data":"דרישות קדם: חדו\"א 1 , אלגברה 1 מרחבי מכפלה פנימית: מרחבים ליניאריים, קבוצה פורשת, בסיס ומימד, חזרה על מספרים קומפלכסיים, מכפלה פנימית, נורמה, מרחבים נורמיים, אורתוגונליות ואורתונורמליות, היטלים אורתוגונליים, שיטת גרהם-שמידט למציאת בסיס אורתונורמלי, מערכות אורתונורמליות אינסופיות, אי-שוויון בסל, הלמה של רימן-לבג, התכנסות בנורמה, סגירות ושלמות. טורי פורייה: פונקציות רציפות למקוטעין, פונקציות מחזוריות, קבוצת הפונקציות הטריגונומטריות, טור פורייה קלאסי, חישוב מקדמי פורייה, תכונות של טור פורייה, טור פורייה קומפלכסי, פונקציות זוגיות ואי-זוגיות, טורי סינוסים וקוסינוסים, התכנסות נקודתית ומשפט דיריכלה, התכנסות במידה שווה של טור פורייה לפונקציה, שוויון פרסיבל, תופעת גיבס, גזירה ואינטגרציה של טור פורייה, טור פורייה בקטעים שונים, שימושים של טור פורייה. התמרת פורייה: הגדרה ותכונות, דוגמאות לחישוב, הקשר בין טור פורייה להתמרת פורייה, תכונת ההזזה, תכונת ה- scaling ,סיבוב בזמן, מודולציה, תכונת הנגזרת, גזירה במישור ההתמרה, קונבולוציה, התמרת פורייה הפוכה, נוסחת פלנשרל. הכרה בסיסית של תכנת Matlab ,אנליזה נומרית באמצעות Matlab :מטריצות: חישובי מטריצות, פתרון משוואות לינאריות. פעולות במטריצות בעזרת Matlab ,פירוק מטריצות. מציאת שורשים של משוואות, אינטגרציה נומרית, גזירה נומרית, ציור גרפים ב- 2 ו- 3 ממדים, ניתוח סטטיסטי של נתונים מניסויים, משוואות דיפרנציאליות: פתרון של משוואה דיפרנציאלית, סוגים של משוואות דיפרנציאליות: רגילות וחלקיות, ליניאריות ואי-ליניאריות, משוואות מסדר ראשון, משוואות ליניאריות, משפט קיום ויחידות, משוואות אי-ליניאריות פתרונות נומריים של משוואות דיפרנציאליות."
    },
    {
      "id": "0122407",
      "name": "אלגוריתמים 1",
      "value": "5.0",
      "required": 1,
      "condition": [
        "0121407"
      ],
      "group":["required"],
      "data":"דרישות קדם: פרקים במבני נתונים אלגוריתמים אלמנטרים בגראפים: ייצוג של גרפים, חיפוש לרוחב, אלגוריתמים חמדניים: מציאת עץ פורש מינימלי בגרף ממושקל, )האלגוריתמים של Kruskal ושל Prim ,)בעיית תכנון הפעילויות, בעיות צביעה של קטעים, בעיית תרמיל הגב, בניית קוד Huffman .מציאת מסילות קלות ביותר בגרף ממושקל:האלגוריתם של Ford-Belman והאלגוריתם של Dijkstra ,אלגוריתם Warshall-Floyd . חיפוש לעומק ושימושיו: מיון טופולוגי, מציאת רכיבים קשירים היטב. זרימה ברשתות: מושגים כלליים, מסילות משפרות, שיטת Ford-Fulkerson ,משפט ה-Cut-Min Flow-Max ,אלגוריתם Karp-Edmonds .מציאת שידוך מקסימלי בגרף דו - צדדי, משפט König ו-Hall .תכנון דינמי: חישוב מקדמי בינום, ת\"ס מונוטונית ארוכה ביותר, ת\"ס משותפת ארוכה ביותר, כפל סדרת מטריצות. אלגוריתמים נוספים בשיטת \"הפרד ומשול\": אלגוריתם Strassen לכפל מטריצות. כפל מקוצר, מציאת זוג נקודות קרובות ביותר במישור, טרנספורם פורייה המהיר. "
    },
    {
      "id": "0132408",
      "name": "רשתות תקשורת מחשבים",
      "value": "3.5",
      "required": 1,
      "condition": [
        "0121405",
        "0111102",
        "0122106"
      ],
      "group":["required"],
      "data":"דרישות קדם: מבוא לתכנות מערכות, אלגברה לינארית)מ(, מבוא להסתברות למידת קורס זה כוללת דיונים, תרגילים ופיתוח יישומים. דיונים: הקדמה; מודל IP/TCP ומודל OSI ;שכבת הטרנספורט ) TCPו UDP ;)שכבת הרשת IP ICMP ;שכבת הערוץ; רשתות תקשורת מקומיות; פרוטוקולי ניתוב; פרוטוקולי שכבת אפליקציה DNS , HTTP ;פצחנות ופריצות למערכות מחשוב; פרוטוקולי אבטחת מערכות מחשוב. פיתוח יישומים: ממשק socket .תכנות יישומי רשתות בסביבת Linux "
    },
    {
      "id": "0132410",
      "name": "מערכות הפעלה",
      "value": "4.0",
      "required": 1,
      "condition": [
        "0112402",
        "0121405",
        "0121407"
      ],
      "group":["required"],
      "data":"דרישות קדם: מבוא לתכנות מערכות, ארגון ותכנות המחשב, פרקים במבנה נתונים. למידת קורס זה כוללת דיונים תרגילים ופיתוח יישומים. דיונים: מערכת הפעלה וקרנל; מבנה הקרנל; ניהול תהליכים: תהליכים ונימים, סמפורים, אלגוריתמי זימון; ניהול זיכרון: זיכרון וירטואלי, סגמנטציה; ניהול קלט פלט; מערכות קבצים; אבטחת מערכת ההפעלה: בקרת גישה. פריצה למחשב ע\"י Overflow buffer .דוגמא רצה: Linux פיתוח יישומים: ממשק מערכת ההפעלה; שירותי מערכת ההפעלה; תכנות מתקדם בסביבת Linux"
    },
    {
      "id": "0131408",
      "name": "אוטומטים ושפות פורמליות",
      "value": "3.5",
      "required": 1,
      "condition": [
        "0121108"
      ],
      "group":["required"],
      "data":"דרישות קדם: מתמטיקה דיסקרטית, פרקים במבני נתונים )במקביל( אוטומט סופי דטרמיניסטי, שפות רגולריות, אוטומט סופי לא דטרמינסטי, ביטויים רגולריים. תכונות של שפות רגולריות, למת הניפוח לשפות רגולריות. תכונות סגור של מחלקת השפות הרגולריות, בעיות הכרעה בשפות רגולריות. יחסי שקילות, משפט Nerode-Myhill ושימושיו, צמצום אוטומטים. דקדוקים חסרי הקשר, חד-משמעות ורב-משמעות, פישוטים וצורות נורמליות. אוטומט מחסנית והשקילות לדקדוקים חסרי הקשר. למת הניפוח לשפות חסרות הקשר. תכונות סגור של מחלקת השפות חסרות ההקשר, בעיות הכרעה בשפות חסרות הקשר."
    },
    {
      "id": "0199702",
      "name": "פרקים בחישוביות וסיבוכיות",
      "value": "3.5",
      "required": 1,
      "condition": [
        "0131408"
      ],
      "group":["required"],
      "data":"דרישות קדם: אלגוריתמים 1( במקביל(, אוטומטים ושפות פורמליות, רמת פטור באנגלית מכונות טיורינג, מכונות עם סרט אחד ומכונות עם כמה סרטים, מכונות דטרמיניסטיות ומכונות לא דטרמיניסטיות, מונים. שקילות המודלים השונים. התזה של צ'רץ' וטיורינג. דוגמאות לשפות מזוהות- טיורינג ולשפות כריעות בעולם של אוטומטים סופיים ובעולם של דקדוקים חסרי הקשר. אוניברסליות. בעיית העצירה. לכסון ורדוקציות. שפות לא כריעות ושפות שאינן מזוהות-טיורינג. שפות שלמות במחלקת השפות המזוהות-טיורינג. משפט Rice . סיבוכיות זמן וסיבוכיות מקום. חישוביות בזמן פולינומיאלי. המחלקה P והמחלקה NP .דיון בשאלה האם NP=P .רדוקציות בזמן פולינומיאלי. משפט Cook .שפות NP–שלמות ממגוון תחומים."
    },
    {
      "id": "0199009",
      "name": "פרויקט",
      "value": "3.5",
      "required": 1,
      "condition": [
        "0121503",
        "0121407"
      ],
      "group":["required"],
      "data": "אין פרטים יעודכנו במשך"
    },
    {
      "id": "0199829",
      "name": "היבטים משפטיים של יחסי עבודה לאנשי תכנה",
      "value": "2.0",
      "required": 0,
      "condition": [],
      "group":["gen"],
      "data":"בקורס נעסוק בסוגיות משפטיות ואתיות הרלוונטיות לסטודנטים למדעי המחשב. נכיר מושגי יסוד במשפט תוך הכרות עם חוזי העבודה. נדון בזכויות סוציאליות בדיני עבודה כגון שעות נוספות, שכר כולל, חופשה, הבראה מחלה פנסיה, ונתעמק בחובת תום הלב. נכיר פסקי דין הרלוונטיים לעבודה בעולם ההייטק. ננתח סוגיות אתיות הרלוונטיות לעובדי מחשוב ובהן הגבלות תחרות, לרבות במעבר בין מקומות עבודה ושמירה על סודות מסחריים."
    },
    {
      "id": "0199703",
      "name": "מערכות מידע",
      "value": "3.5",
      "required": 0,
      "condition": [
        "0121502"
      ],
      "group":["gen"],
      "data":"דרישות קדם: תכנות מונחה עצמים )Java) מטרת הקורס להקנות ידע והבנה בתחום מערכות מידע בכלל ובתהליך תכנון ועיצוב של מערכות מידע בפרט. הנושאים שילמדו בקורס כוללים: תפקיד מערכת המידע בארגון והסביבה הארגונית, הכרות עם סוגי מערכות מידע, תהליכי פיתוח של מערכות מידע, שיקולים בעיצוב מערכות מידע )DB , ממשקים ועיבודים(, עיצוב מערכת מידע בגישה הקלאסית )DFD ,ERD ,ADISSA )לעומת עיצוב מערכת מידע בגישה מכוונת עצמים )UML .)במהלך הקורס יתנסו הסטודנטים בתכנון ועיצוב של מערכות מידע בגישות השונות."
    }
  ]